let handler = async (m, { command, text }) => {
  const message = `
*اهلا بك في قائمة أوامر بوت نانو🤖.*

*يرجى الإبلاغ عن أي مشكلة تواجهك وسنعمل على حلها في أقرب وقت ممكن❤️*
*تأكد من كتابة النقطة قبل الأوامر لتعمل بشكل صحيح.*

*قسم الديني🕋*
1. [.قرآن] - يجيبك بآية قرآنية.
2. [.الله] - أسماء الله الحسنى (اختار رقم الاسم والبوت سيظهره ومعناه).
3. [.اذكار الصـباح] - أذكار الصـباح كاملة.
4. [.اذكار المـساء] - أذكار المساء كاملة.
5. [.احاديث] - أحاديث نبوية.
6. [.دين] - أسئلة دينية.

*قسم الجروبات👥*
1. [.الجروب] - معلومات الجروب.
2. [.الاشباح] - الأعضاء غير المتفاعلين في الجروب.
3. [.حذف] - حذف رسالة محددة.
4. [.تحذير] - تحذير شخص (3 تحذيرات وبعدها طرد).
5. [.شيل-التحذير] - إزالة التحذير.
6. [.طرد] - طرد شخص محدد.
7. [.منشن] - منشن لجميع الأعضاء.
8. [.منشني] - منشن لك.
9. [.المشرفين] - قائمة مشرفي الجروب.
10. [.خفض] - خفض رتبة أدمن.
11. [.رفع] - رفع شخص إلى أدمن.
12. [.لينك] - جلب رابط الجروب.
13. [.اعاده] - تغيير رابط الجروب.
14. [.اختفاء] - إخفاء وجودك أونلاين من البوت (للإلغاء [.افك]).
15. [.توب] - عرض توب الجروب.

*قسم السوشيال🗂️*
1. [.اغنيه] - جلب أغنية من اليوتيوب.
2. [.انستجرام] - بحث عن حساب على إنستجرام.
3. [.انستا] - تحميل مقطع من إنستجرام.
4. [.ستوري-انستا] - تحميل ستوري من إنستجرام.
5. [.تيكتوك-صوره] - تحميل صورة من تيك توك.
6. [.تيكتوك] - تحميل فيديو من تيك توك.
7. [.يوتيوب] - بحث عن فيديو في يوتيوب.
8. [.فيس] - تحميل من فيسبوك.
9. [.اكس] - تحميل فيديو من اكس.

*قسم الشخصية👤*
1. [.نصيحه] - نصيحة عشوائية.
2. [.عباره رومناسيه] - عبارات رومانسية.
3. [.كت] - أسماء عشوائية.
4. [.شخصيه] - شخصية الشخص المحدد.

*قسم الأدوات⚙️*
1. [.بحث] - بحث في جوجل.
2. [.ترجمه] - ترجمة لأي لغة.
3. [.تحميل] - تحميل أي ملف.
4. [.ميديافاير] - تحميل ملف من ميديافاير.
5. [.مهكر] - تحميل تطبيق مدفوع أو مهكر.
6. [.متجر] - جلب تطبيق من جوجل بلاي.
7. [.باركود] - تحويل الرابط إلى باركود.
8. [.خلفيه] - جلب خلفية حسب الطلب.
9. [.عميق] - تغيير الصوت إلى صوت عميق.
10. [.لكرتون] - تحويل الصورة إلى كارتون.
11. [.لانمي] - تحويل الصورة إلى أنمي.
12. [.جيف] - تحويل الفيديو إلى GIF.
13. [.لصوره] - تحويل الستيك إلى صورة.
14. [.لفيديو] - تحويل الستيك إلى فيديو.
15. [.لصوت] - تحويل الفيديو إلى صوت.
16. [.سرقه] - سرقة ستيك.
17. [.زخرفه] - زخرفة النص.
18. [.انطق] - تحويل النص إلى صوت.
19. [.دمج] - دمج إيموجيين.
20. [.لريك] - تحويل الصوت إلى ريك.
21. [.تليجراف] - تحويل الملف إلى رابط.
22. [.فري بيك] - البحث عن صورة.
23. [.قطه] - صورة قطة.
24. [.بروفايلي] - ملفك الشخصي.
25. [.بنك]
26. [.لملصق] - تحويل الصورة إلى ملصق.
27. [.لملصق-تحويل] - تحويل الصو
*قسم الرفاهية🕹️*
1. [.اكس] - لعبة إكس أو.
2. [.اسألة] - تحدي أسئلة.
3. [.رياضيات] - تحديات رياضية.
4. [.صراحه] - أسئلة صراحة.
5. [.تحدي] - تحدي شخص في لعبة.
6. [.العب] - حجرة ورقة مقص ضد البوت.
7. [.حظ] - لعبة حظ.
8. [.الكلمات] - تجميع الحروف.
9. [.لو] - لعبة لو.
10. [.ذكاء] - تخمين ذكائك.
11. [.غباء] - تخمين غبائك.
12. [.الحب] - تخمين نسبة الحب.
13. [.القدوه] - تخمين قدوتك.
14. [.سؤال] - أسئلة عشوائية.
15. [.ميمز] - عرض ميمز.
16. [.ميمز انمي] - ميمز أنمي.
17. [.انمي] - معلومات عن أنمي.
18. [.زواج] - زواج شخصين.
19. [.تاج]
20. [.فعاليات]
21. [.الكره]
22. [.تحدي] _ لعبت حجر ورقه مقص
23. [.جمال]


*قسم الاكسبي⭐️*
1. [.راتب] - جلب الراتب.

*قسم التطبيقات*
1. [.تطبيق] - جلب أي تطبيق باسمه.

*قسم البوت🤖*
1. [.لفل] - مستوى تفاعلك مع البوت.
2. [.الماسي] - عرض مستوى الماسي.
3. [.يومي] - جلب هدية يومية.
4. [.تعدين] - التعدين.
5. [.شراء] - شراء الماس أو اكسبي.
6. [.عمل] - سؤال مقابل اكسبي.
7. [.هجوم] - سرقة اكسبي.
8. [.رمزي] - رقمك التسلسلي.
9. [.تصليح] - إصلاح أي مشكلة تواجهك.

*قسم المطور👨🏼‍💻*
1. [.بلاغ] - التواصل مع المطور.
2. [.نشر] - نشر رسالة لجميع مستخدمي البوت.
3. [.جروبات] - جلب جميع الجروبات التي بداخلها البوت.
4. [.بريم] - تمييز شخص.
5. [.خفض-التميير] - خفض تمييز شخص.
6. [.المستخدين] - عدد مستخدمي البوت.
7. [.حظر | فك-حظر] - حظر أو فك حظر شات.
8. [.المحظورين] - قائمة المحظورين.
9. [.بان | فك البان] - حظر أو فك حظر مستخدم.
10. [.بلوك | رفع بلوك] - حظر أو رفع الحظر.
11. [.البلوكات] - قائمة المحظورين.
12. [.انضم] - دخول جروب.
13. [.أخرج] - خروج من جروب.
14. [.المميزين] - قائمة المميزين.
15. [.اضف-الماس] - إضافة ماس.
16. [.اضف-اكسبي] - إضافة اكسبي.
17. [.ادمن] - رفع شخص إلى أدمن في الجروب.

*المطور:*
🤖┋*Abdo*┋🤖
*https://api.whatsapp.com/send/?phone=01151094460*

`.trim();
  m.reply(message, null, m.mentionedJid ? { 'mentions': m.mentionedJid } : {});
};

handler.help = ['اوامر <teks>?'];
handler.tags = ['fun', 'اوامر'];
handler.command = /^(اوامر)$/i;

export default handler;
